.cf.xml/InformationRegisters/обм_Приемники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>обм_Приемники</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>удалитьПриемник</Name>
					<Comment>Не актуально, перенесено в измерение</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_ПакетыДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеТипаПриемника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_категория</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_ид</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приемник</Name>
					<Comment>Это должен быть ресурс, но нужен флаг "Ведущее".</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

.cf.xml/InformationRegisters/обм_Приемники/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	// Регистр не предназначен для обмена, он сам часть подсистемы обмена
	// Поэтому записывать в режиме ОбменДанными.Загрузка
	// Чтобы не срабатывали сторонние подписки и не вызывали задержку
	ЭтотОбъект.ОбменДанными.Загрузка = Истина;
	
	Для Каждого запись Из ЭтотОбъект Цикл
		// Это справочное поле на форме списка
		запись.ПредставлениеТипаПриемника = Строка(ТипЗнч(запись.Приемник));
		
		Если Не ЗначениеЗаполнено(запись.Приемник) И ЗначениеЗаполнено(запись.удалитьПриемник) Тогда
			запись.Приемник = запись.УдалитьПриемник;
			
		КонецЕсли;
		
	КонецЦикла;
	запись = Неопределено;
	
КонецПроцедуры
